package figur;

public class Main {

    public static void main(String[] args) {
	// write your code here
    }
}


//"В отдельном пакете figur нужно создать структуру классов и имплементировать необходимые методы.
//        Должен быть базовый абстрактный класс и его наследники.
//        Все функции должны быть реализованы.
//        В классе Main с главным методом main должно быть реализовано задание.
//
//        Описание класов:
//        Создать структуру классов для круга, квадрата и треугольника. Каждый из них должен иметь следующие свойства и методы
//        координаты
//        - функцию перемещения
//        - функцию расчета площади
//        - функцию изменения размера
//
//        Задание
//        В функции main должен быть рализован следующие пункты:
//        - создания массива рандомных фигур размером в 10 элементов.
//        - изменение размера для каждой фигуры из массива рандомным коофициентом от 0 до 1
//        - сортировка фигур по площади
//        "